Revit 2024 API
BuiltInFailures.ImportFailures.ImportTooFarAway Property
 Imported objects located a large distance from the model might not display properly. The 'Center-to-Center' option will be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ImportTooFarAway { get; }
Visual Basic
Public Shared ReadOnly Property ImportTooFarAway As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ImportTooFarAway {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace